
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       4 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                               |
|:--------:|:------------------------------------------------------------------------|
|    🟢     | `aws_iam_policy.state-bucket-tester-permissions`                        |
|    🟢     | `aws_iam_role.state-bucket-tester`                                      |
|    🟢     | `aws_iam_role_policy_attachment.state-bucket-tester`                    |
|    🟢     | `aws_iam_role_policy_attachment.state-bucket-tester-pytest-permissions` |
|    🟢     | `data.aws_iam_policy_document.state-bucket-tester-permissions:`         |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/7bc8c924-2a76-4f8f-aa6b-d4dafbd1be40/terraform-bin plan -no-color --out=tf.plan
data.aws_iam_policy_document.state-bucket-tester-permissions: Reading...
data.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Reading...
data.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Read complete after 0s [id=2899629952]
data.aws_iam_policy_document.service-network-tester-permissions: Reading...
data.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Reading...
data.aws_iam_policy_document.state-bucket-tester-permissions: Read complete after 0s [id=1801548006]
data.aws_iam_policy_document.gha-admin-tester-permissions: Reading...
data.aws_iam_policy_document.omnibus-assume: Reading...
data.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Read complete after 0s [id=1154989936]
data.aws_iam_policy_document.gha-admin-tester-permissions: Read complete after 0s [id=3247938485]
data.aws_iam_policy_document.service-network-tester-permissions: Read complete after 0s [id=3837005140]
data.aws_iam_policy_document.website-pod-tester-permissions: Reading...
data.aws_iam_policy_document.omnibus-assume: Read complete after 0s [id=2101509072]
data.aws_iam_policy_document.website-pod-tester-permissions: Read complete after 0s [id=221812016]
aws_ec2_serial_console_access.console-ue2: Refreshing state... [id=us-east-1]
aws_ec2_serial_console_access.console-ue1: Refreshing state... [id=us-east-1]
module.infrahouse_com.aws_route53_zone.ci_cd_infrahouse_com: Refreshing state... [id=Z06790082OU0POPWOCPZ4]
aws_iam_role.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only]
aws_iam_role.omnibus: Refreshing state... [id=omnibus]
module.infrahouse-omnibus-cache.aws_s3_bucket.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]
data.aws_iam_policy_document.pytest-permissions: Reading...
data.aws_iam_policy.read-only-access: Reading...
aws_ec2_serial_console_access.console-uw1: Refreshing state... [id=us-west-1]
aws_iam_policy.service-network-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/service-network-tester-permissions]
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]
aws_iam_policy.website-pod-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/website-pod-tester-permissions]
data.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=3140924852]
data.aws_iam_policy.administrator-access: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3133841775]
aws_iam_role.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control]
aws_iam_policy.gha-admin-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/gha-admin-tester-permissions]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Reading...
aws_iam_policy.TwinDBTestRunner: Refreshing state... [id=arn:aws:iam::303467602807:policy/TwinDBTestRunner]
aws_iam_user.twindb_test_runner: Refreshing state... [id=twindb_test_runner]
aws_ssm_parameter.gh_secrets_namespace: Refreshing state... [id=gh_secrets_namespace]
aws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001]
module.ih-tf-aws-control-303467602807-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-aws-control-303467602807-github]
aws_iam_access_key.twindb_test_runner: Refreshing state... [id=AKIAUNKAUEN32IWKRSEZ]
data.aws_iam_policy_document.service-network-tester-assume: Reading...
data.aws_iam_policy_document.service-network-tester-assume: Read complete after 0s [id=1585108788]
data.aws_iam_policy_document.gha-admin-tester-assume: Reading...
data.aws_iam_policy_document.gha-admin-tester-assume: Read complete after 0s [id=2006571739]
data.aws_iam_policy_document.website-pod-tester-assume: Reading...
data.aws_iam_policy_document.website-pod-tester-assume: Read complete after 0s [id=3276496045]
data.aws_iam_policy_document.state-bucket-tester-assume: Reading...
aws_iam_user_policy_attachment.twindb_test_runner: Refreshing state... [id=twindb_test_runner-20230701180031084700000001]
data.aws_iam_policy_document.state-bucket-tester-assume: Read complete after 0s [id=1923589509]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2687752271]
aws_iam_role.service-network-tester: Refreshing state... [id=service-network-tester]
aws_iam_role.gha-admin-tester: Refreshing state... [id=gha-admin-tester]
aws_iam_role.website-pod-tester: Refreshing state... [id=website-pod-tester]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github]
aws_iam_role_policy_attachment.service-network-tester: Refreshing state... [id=service-network-tester-20230703194225287600000001]
aws_iam_role_policy_attachment.service-network-tester-pytest-permissions: Refreshing state... [id=service-network-tester-20231009203124842800000002]
aws_iam_role_policy_attachment.website-pod-tester: Refreshing state... [id=website-pod-tester-20230813162622267200000002]
aws_iam_role_policy_attachment.website-pod-tester-sernive-network-permissions: Refreshing state... [id=website-pod-tester-20230813162622172900000001]
aws_iam_role_policy_attachment.gha-admin-tester: Refreshing state... [id=gha-admin-tester-20231009193434697100000001]
aws_iam_role_policy_attachment.gha-admin-tester-pytest-permissions: Refreshing state... [id=gha-admin-tester-20231009203124866100000003]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github-20230908004138459800000001]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=3570539128]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin]
data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control-20230630030803961200000001]
data.aws_iam_policy.read-only-access: Read complete after 1s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]
aws_iam_role_policy_attachment.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only-20230811180635084000000001]
module.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin-20230702152748646400000001]
module.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Reading...
data.aws_iam_policy_document.omnibus-permissions: Reading...
module.infrahouse-omnibus-cache.aws_s3_bucket_public_access_block.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]
module.infrahouse-omnibus-cache.aws_s3_bucket_ownership_controls.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]
data.aws_iam_policy_document.omnibus-permissions: Read complete after 0s [id=4274068248]
module.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Read complete after 0s [id=123587806]
aws_iam_policy.omnibus: Refreshing state... [id=arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001]
aws_iam_role_policy_attachment.omnibus: Refreshing state... [id=omnibus-20230729042432323400000002]
module.infrahouse-omnibus-cache.aws_s3_bucket_acl.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache,public-read]
module.infrahouse-omnibus-cache.aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-omnibus-cache]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.state-bucket-tester-permissions will be created
  + resource "aws_iam_policy" "state-bucket-tester-permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "state-bucket-tester-permissions"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sts:GetCallerIdentity",
                          + "sts:AssumeRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # aws_iam_role.state-bucket-tester will be created
  + resource "aws_iam_role" "state-bucket-tester" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::990466748045:user/aleks"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-state-bucket:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to test module terraform-aws-gha-admin"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "state-bucket-tester"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.state-bucket-tester will be created
  + resource "aws_iam_role_policy_attachment" "state-bucket-tester" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "state-bucket-tester"
    }

  # aws_iam_role_policy_attachment.state-bucket-tester-pytest-permissions will be created
  + resource "aws_iam_role_policy_attachment" "state-bucket-tester-pytest-permissions" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001"
      + role       = "state-bucket-tester"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.state-bucket-tester-permissions: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-303467602807-read-only-assume: Read complete after 0s [id=2899629952]%0Adata.aws_iam_policy_document.service-network-tester-permissions: Reading...%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Reading...%0Adata.aws_iam_policy_document.state-bucket-tester-permissions: Read complete after 0s [id=1801548006]%0Adata.aws_iam_policy_document.gha-admin-tester-permissions: Reading...%0Adata.aws_iam_policy_document.omnibus-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-ih-cicd-control-assume: Read complete after 0s [id=1154989936]%0Adata.aws_iam_policy_document.gha-admin-tester-permissions: Read complete after 0s [id=3247938485]%0Adata.aws_iam_policy_document.service-network-tester-permissions: Read complete after 0s [id=3837005140]%0Adata.aws_iam_policy_document.website-pod-tester-permissions: Reading...%0Adata.aws_iam_policy_document.omnibus-assume: Read complete after 0s [id=2101509072]%0Adata.aws_iam_policy_document.website-pod-tester-permissions: Read complete after 0s [id=221812016]%0Aaws_ec2_serial_console_access.console-ue2: Refreshing state... [id=us-east-1]%0Aaws_ec2_serial_console_access.console-ue1: Refreshing state... [id=us-east-1]%0Amodule.infrahouse_com.aws_route53_zone.ci_cd_infrahouse_com: Refreshing state... [id=Z06790082OU0POPWOCPZ4]%0Aaws_iam_role.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only]%0Aaws_iam_role.omnibus: Refreshing state... [id=omnibus]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Adata.aws_iam_policy_document.pytest-permissions: Reading...%0Adata.aws_iam_policy.read-only-access: Reading...%0Aaws_ec2_serial_console_access.console-uw1: Refreshing state... [id=us-west-1]%0Aaws_iam_policy.service-network-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/service-network-tester-permissions]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com]%0Aaws_iam_policy.website-pod-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/website-pod-tester-permissions]%0Adata.aws_iam_policy_document.pytest-permissions: Read complete after 0s [id=3140924852]%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3133841775]%0Aaws_iam_role.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control]%0Aaws_iam_policy.gha-admin-tester-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/gha-admin-tester-permissions]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Reading...%0Aaws_iam_policy.TwinDBTestRunner: Refreshing state... [id=arn:aws:iam::303467602807:policy/TwinDBTestRunner]%0Aaws_iam_user.twindb_test_runner: Refreshing state... [id=twindb_test_runner]%0Aaws_ssm_parameter.gh_secrets_namespace: Refreshing state... [id=gh_secrets_namespace]%0Aaws_iam_policy.pytest-permissions: Refreshing state... [id=arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::303467602807:policy/ih-tf-aws-control-303467602807-github]%0Aaws_iam_access_key.twindb_test_runner: Refreshing state... [id=AKIAUNKAUEN32IWKRSEZ]%0Adata.aws_iam_policy_document.service-network-tester-assume: Reading...%0Adata.aws_iam_policy_document.service-network-tester-assume: Read complete after 0s [id=1585108788]%0Adata.aws_iam_policy_document.gha-admin-tester-assume: Reading...%0Adata.aws_iam_policy_document.gha-admin-tester-assume: Read complete after 0s [id=2006571739]%0Adata.aws_iam_policy_document.website-pod-tester-assume: Reading...%0Adata.aws_iam_policy_document.website-pod-tester-assume: Read complete after 0s [id=3276496045]%0Adata.aws_iam_policy_document.state-bucket-tester-assume: Reading...%0Aaws_iam_user_policy_attachment.twindb_test_runner: Refreshing state... [id=twindb_test_runner-20230701180031084700000001]%0Adata.aws_iam_policy_document.state-bucket-tester-assume: Read complete after 0s [id=1923589509]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2687752271]%0Aaws_iam_role.service-network-tester: Refreshing state... [id=service-network-tester]%0Aaws_iam_role.gha-admin-tester: Refreshing state... [id=gha-admin-tester]%0Aaws_iam_role.website-pod-tester: Refreshing state... [id=website-pod-tester]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github]%0Aaws_iam_role_policy_attachment.service-network-tester: Refreshing state... [id=service-network-tester-20230703194225287600000001]%0Aaws_iam_role_policy_attachment.service-network-tester-pytest-permissions: Refreshing state... [id=service-network-tester-20231009203124842800000002]%0Aaws_iam_role_policy_attachment.website-pod-tester: Refreshing state... [id=website-pod-tester-20230813162622267200000002]%0Aaws_iam_role_policy_attachment.website-pod-tester-sernive-network-permissions: Refreshing state... [id=website-pod-tester-20230813162622172900000001]%0Aaws_iam_role_policy_attachment.gha-admin-tester: Refreshing state... [id=gha-admin-tester-20231009193434697100000001]%0Aaws_iam_role_policy_attachment.gha-admin-tester-pytest-permissions: Refreshing state... [id=gha-admin-tester-20231009203124866100000003]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-303467602807-github-20230908004138459800000001]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=3570539128]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin]%0Adata.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_role_policy_attachment.ih-tf-cicd-control: Refreshing state... [id=ih-tf-cicd-control-20230630030803961200000001]%0Adata.aws_iam_policy.read-only-access: Read complete after 1s [id=arn:aws:iam::aws:policy/ReadOnlyAccess]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control-303467602807-read-only: Refreshing state... [id=ih-tf-aws-control-303467602807-read-only-20230811180635084000000001]%0Amodule.ih-tf-aws-control-303467602807-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-303467602807-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-303467602807-admin-20230702152748646400000001]%0Amodule.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Reading...%0Adata.aws_iam_policy_document.omnibus-permissions: Reading...%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_public_access_block.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_ownership_controls.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache]%0Adata.aws_iam_policy_document.omnibus-permissions: Read complete after 0s [id=4274068248]%0Amodule.infrahouse-omnibus-cache.data.aws_iam_policy_document.public-access: Read complete after 0s [id=123587806]%0Aaws_iam_policy.omnibus: Refreshing state... [id=arn:aws:iam::303467602807:policy/omnibus20230729042431999200000001]%0Aaws_iam_role_policy_attachment.omnibus: Refreshing state... [id=omnibus-20230729042432323400000002]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_acl.omnibus-cache: Refreshing state... [id=infrahouse-omnibus-cache,public-read]%0Amodule.infrahouse-omnibus-cache.aws_s3_bucket_policy.public-access: Refreshing state... [id=infrahouse-omnibus-cache]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_policy.state-bucket-tester-permissions will be created%0A  + resource "aws_iam_policy" "state-bucket-tester-permissions" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "state-bucket-tester-permissions"%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "sts:GetCallerIdentity",%0A                          + "sts:AssumeRole",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A    }%0A%0A  # aws_iam_role.state-bucket-tester will be created%0A  + resource "aws_iam_role" "state-bucket-tester" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = "arn:aws:iam::990466748045:user/aleks"%0A                        }%0A                    },%0A                  + {%0A                      + Action    = "sts:AssumeRoleWithWebIdentity"%0A                      + Condition = {%0A                          + StringEquals = {%0A                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"%0A                            }%0A                          + StringLike   = {%0A                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-state-bucket:*"%0A                            }%0A                        }%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Federated = "arn:aws:iam::303467602807:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + description           = "Role to test module terraform-aws-gha-admin"%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "state-bucket-tester"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "created_by" = "infrahouse/aws-control-303467602807"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.state-bucket-tester will be created%0A  + resource "aws_iam_role_policy_attachment" "state-bucket-tester" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"%0A      + role       = "state-bucket-tester"%0A    }%0A%0A  # aws_iam_role_policy_attachment.state-bucket-tester-pytest-permissions will be created%0A  + resource "aws_iam_role_policy_attachment" "state-bucket-tester-pytest-permissions" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::303467602807:policy/pytest-permissions20231009203124555500000001"%0A      + role       = "state-bucket-tester"%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC83YmM4YzkyNC0yYTc2LTRmOGYtYWE2Yi1kNGRhZmJkMWJlNDAvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seS1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seS1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4OTk2Mjk5NTJdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtaWgtY2ljZC1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xODAxNTQ4MDA2XVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naGEtYWRtaW4tdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWloLWNpY2QtY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExNTQ5ODk5MzZdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdoYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMyNDc5Mzg0ODVdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM4MzcwMDUxNDBdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LndlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5vbW5pYnVzLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjEwMTUwOTA3Ml1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjE4MTIwMTZdXG5hd3NfZWMyX3NlcmlhbF9jb25zb2xlX2FjY2Vzcy5jb25zb2xlLXVlMjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXMtZWFzdC0xXVxuYXdzX2VjMl9zZXJpYWxfY29uc29sZV9hY2Nlc3MuY29uc29sZS11ZTE6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXVzLWVhc3QtMV1cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M196b25lLmNpX2NkX2luZnJhaG91c2VfY29tOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDY3OTAwODJPVTBQT1BXT0NQWjRdXG5hd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXJlYWQtb25seV1cbmF3c19pYW1fcm9sZS5vbW5pYnVzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1vbW5pYnVzXVxubW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0Lm9tbmlidXMtY2FjaGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZV1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHl0ZXN0LXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5LnJlYWQtb25seS1hY2Nlc3M6IFJlYWRpbmcuLi5cbmF3c19lYzJfc2VyaWFsX2NvbnNvbGVfYWNjZXNzLmNvbnNvbGUtdXcxOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cy13ZXN0LTFdXG5hd3NfaWFtX3BvbGljeS5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6MzAzNDY3NjAyODA3OnBvbGljeS9zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zXVxubW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbmF3c19pYW1fcG9saWN5LndlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvd2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMxNDA5MjQ4NTJdXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMTMzODQxNzc1XVxuYXdzX2lhbV9yb2xlLmloLXRmLWNpY2QtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtY2ljZC1jb250cm9sXVxuYXdzX2lhbV9wb2xpY3kuZ2hhLWFkbWluLXRlc3Rlci1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvZ2hhLWFkbWluLXRlc3Rlci1wZXJtaXNzaW9uc11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZGluZy4uLlxuYXdzX2lhbV9wb2xpY3kuVHdpbkRCVGVzdFJ1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvVHdpbkRCVGVzdFJ1bm5lcl1cbmF3c19pYW1fdXNlci50d2luZGJfdGVzdF9ydW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXR3aW5kYl90ZXN0X3J1bm5lcl1cbmF3c19zc21fcGFyYW1ldGVyLmdoX3NlY3JldHNfbmFtZXNwYWNlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naF9zZWNyZXRzX25hbWVzcGFjZV1cbmF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvcHl0ZXN0LXBlcm1pc3Npb25zMjAyMzEwMDkyMDMxMjQ1NTU1MDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWdpdGh1Yl1cbmF3c19pYW1fYWNjZXNzX2tleS50d2luZGJfdGVzdF9ydW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFLSUFVTktBVUVOMzJJV0tSU0VaXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTU4NTEwODc4OF1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2hhLWFkbWluLXRlc3Rlci1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2hhLWFkbWluLXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwMDY1NzE3MzldXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LndlYnNpdGUtcG9kLXRlc3Rlci1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzI3NjQ5NjA0NV1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1hc3N1bWU6IFJlYWRpbmcuLi5cbmF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC50d2luZGJfdGVzdF9ydW5uZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXR3aW5kYl90ZXN0X3J1bm5lci0yMDIzMDcwMTE4MDAzMTA4NDcwMDAwMDAwMV1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE5MjM1ODk1MDldXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI2ODc3NTIyNzFdXG5hd3NfaWFtX3JvbGUuc2VydmljZS1uZXR3b3JrLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2VydmljZS1uZXR3b3JrLXRlc3Rlcl1cbmF3c19pYW1fcm9sZS5naGEtYWRtaW4tdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyXVxuYXdzX2lhbV9yb2xlLndlYnNpdGUtcG9kLXRlc3RlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2l0ZS1wb2QtdGVzdGVyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UtbmV0d29yay10ZXN0ZXItMjAyMzA3MDMxOTQyMjUyODc2MDAwMDAwMDFdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UtbmV0d29yay10ZXN0ZXItMjAyMzEwMDkyMDMxMjQ4NDI4MDAwMDAwMDJdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD13ZWJzaXRlLXBvZC10ZXN0ZXItMjAyMzA4MTMxNjI2MjIyNjcyMDAwMDAwMDJdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLXNlcm5pdmUtbmV0d29yay1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2l0ZS1wb2QtdGVzdGVyLTIwMjMwODEzMTYyNjIyMTcyOTAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmdoYS1hZG1pbi10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdoYS1hZG1pbi10ZXN0ZXItMjAyMzEwMDkxOTM0MzQ2OTcxMDAwMDAwMDFdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2hhLWFkbWluLXRlc3Rlci1weXRlc3QtcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdoYS1hZG1pbi10ZXN0ZXItMjAyMzEwMDkyMDMxMjQ4NjYxMDAwMDAwMDNdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1naXRodWItMjAyMzA5MDgwMDQxMzg0NTk4MDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTcwNTM5MTI4XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbl1cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtY2ljZC1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1jaWNkLWNvbnRyb2wtMjAyMzA2MzAwMzA4MDM5NjEyMDAwMDAwMDFdXG5kYXRhLmF3c19pYW1fcG9saWN5LnJlYWQtb25seS1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L1JlYWRPbmx5QWNjZXNzXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHk6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHktMjAyMzA4MTExODA2MzUwODQwMDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLTIwMjMwNzAyMTUyNzQ4NjQ2NDAwMDAwMDAxXVxubW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB1YmxpYy1hY2Nlc3M6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQub21uaWJ1cy1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sub21uaWJ1cy1jYWNoZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXVxubW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X293bmVyc2hpcF9jb250cm9scy5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lm9tbmlidXMtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQyNzQwNjgyNDhdXG5tb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHVibGljLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTIzNTg3ODA2XVxuYXdzX2lhbV9wb2xpY3kub21uaWJ1czogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvb21uaWJ1czIwMjMwNzI5MDQyNDMxOTk5MjAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPW9tbmlidXMtMjAyMzA3MjkwNDI0MzIzMjM0MDAwMDAwMDJdXG5tb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfYWNsLm9tbmlidXMtY2FjaGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZSxwdWJsaWMtcmVhZF1cbm1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldF9wb2xpY3kucHVibGljLWFjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgYXdzX2lhbV9wb2xpY3kuc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJzdGF0ZS1idWNrZXQtdGVzdGVyLXBlcm1pc3Npb25zXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gXCJzdGF0ZS1idWNrZXQtdGVzdGVyLXBlcm1pc3Npb25zXCJcbiAgICAgICsgbmFtZV9wcmVmaXggPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgID0gXCIvXCJcbiAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzdHM6R2V0Q2FsbGVySWRlbnRpdHlcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInN0czpBc3N1bWVSb2xlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcIipcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBhd3NfaWFtX3JvbGUuc3RhdGUtYnVja2V0LXRlc3RlciB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZVwiIFwic3RhdGUtYnVja2V0LXRlc3RlclwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhc3N1bWVfcm9sZV9wb2xpY3kgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgID0gXCJzdHM6QXNzdW1lUm9sZVwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFByaW5jaXBhbCA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBBV1MgPSBcImFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6dXNlci9hbGVrc1wiXG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVXaXRoV2ViSWRlbnRpdHlcIlxuICAgICAgICAgICAgICAgICAgICAgICsgQ29uZGl0aW9uID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFN0cmluZ0VxdWFscyA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJ0b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbTphdWRcIiA9IFwic3RzLmFtYXpvbmF3cy5jb21cIlxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBTdHJpbmdMaWtlICAgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206c3ViXCIgPSBcInJlcG86aW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldDoqXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFByaW5jaXBhbCA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBGZWRlcmF0ZWQgPSBcImFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbVwiXG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgPSBcIlJvbGUgdG8gdGVzdCBtb2R1bGUgdGVycmFmb3JtLWF3cy1naGEtYWRtaW5cIlxuICAgICAgKyBmb3JjZV9kZXRhY2hfcG9saWNpZXMgPSBmYWxzZVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1hbmFnZWRfcG9saWN5X2FybnMgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWF4X3Nlc3Npb25fZHVyYXRpb24gID0gMzYwMFxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgPSBcInN0YXRlLWJ1Y2tldC10ZXN0ZXJcIlxuICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgICAgICAgICAgICA9IFwiL1wiXG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgIH1cbiAgICAgICsgdW5pcXVlX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIGF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1idWNrZXQtdGVzdGVyXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXCJcbiAgICAgICsgcm9sZSAgICAgICA9IFwic3RhdGUtYnVja2V0LXRlc3RlclwiXG4gICAgfVxuXG4gICMgYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcHl0ZXN0LXBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1idWNrZXQtdGVzdGVyLXB5dGVzdC1wZXJtaXNzaW9uc1wiIHtcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5X2FybiA9IFwiYXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvcHl0ZXN0LXBlcm1pc3Npb25zMjAyMzEwMDkyMDMxMjQ1NTU1MDAwMDAwMDFcIlxuICAgICAgKyByb2xlICAgICAgID0gXCJzdGF0ZS1idWNrZXQtdGVzdGVyXCJcbiAgICB9XG5cblBsYW46IDQgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1yZWFkLW9ubHktYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5LWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg5OTYyOTk1Ml0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWloLWNpY2QtY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnN0YXRlLWJ1Y2tldC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE4MDE1NDgwMDZdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naGEtYWRtaW4tdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5vbW5pYnVzLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtaWgtY2ljZC1jb250cm9sLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTE1NDk4OTkzNl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdoYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMyNDc5Mzg0ODVdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zODM3MDA1MTQwXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5vbW5pYnVzLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjEwMTUwOTA3Ml0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LndlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjIxODEyMDE2XSUwQWF3c19lYzJfc2VyaWFsX2NvbnNvbGVfYWNjZXNzLmNvbnNvbGUtdWUyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cy1lYXN0LTFdJTBBYXdzX2VjMl9zZXJpYWxfY29uc29sZV9hY2Nlc3MuY29uc29sZS11ZTE6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXVzLWVhc3QtMV0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfem9uZS5jaV9jZF9pbmZyYWhvdXNlX2NvbTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA2NzkwMDgyT1UwUE9QV09DUFo0XSUwQWF3c19pYW1fcm9sZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5XSUwQWF3c19pYW1fcm9sZS5vbW5pYnVzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1vbW5pYnVzXSUwQW1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldC5vbW5pYnVzLWNhY2hlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGVdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5weXRlc3QtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5LnJlYWQtb25seS1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFhd3NfZWMyX3NlcmlhbF9jb25zb2xlX2FjY2Vzcy5jb25zb2xlLXV3MTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXMtd2VzdC0xXSUwQWF3c19pYW1fcG9saWN5LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3NlcnZpY2UtbmV0d29yay10ZXN0ZXItcGVybWlzc2lvbnNdJTBBbW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV0lMEFhd3NfaWFtX3BvbGljeS53ZWJzaXRlLXBvZC10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3dlYnNpdGUtcG9kLXRlc3Rlci1wZXJtaXNzaW9uc10lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnB5dGVzdC1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzE0MDkyNDg1Ml0lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMxMzM4NDE3NzVdJTBBYXdzX2lhbV9yb2xlLmloLXRmLWNpY2QtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtY2ljZC1jb250cm9sXSUwQWF3c19pYW1fcG9saWN5LmdoYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2doYS1hZG1pbi10ZXN0ZXItcGVybWlzc2lvbnNdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkaW5nLi4uJTBBYXdzX2lhbV9wb2xpY3kuVHdpbkRCVGVzdFJ1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvVHdpbkRCVGVzdFJ1bm5lcl0lMEFhd3NfaWFtX3VzZXIudHdpbmRiX3Rlc3RfcnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGJfdGVzdF9ydW5uZXJdJTBBYXdzX3NzbV9wYXJhbWV0ZXIuZ2hfc2VjcmV0c19uYW1lc3BhY2U6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWdoX3NlY3JldHNfbmFtZXNwYWNlXSUwQWF3c19pYW1fcG9saWN5LnB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpwb2xpY3kvcHl0ZXN0LXBlcm1pc3Npb25zMjAyMzEwMDkyMDMxMjQ1NTU1MDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1naXRodWJdJTBBYXdzX2lhbV9hY2Nlc3Nfa2V5LnR3aW5kYl90ZXN0X3J1bm5lcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QUtJQVVOS0FVRU4zMklXS1JTRVpdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc2VydmljZS1uZXR3b3JrLXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE1ODUxMDg3ODhdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naGEtYWRtaW4tdGVzdGVyLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2hhLWFkbWluLXRlc3Rlci1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwMDY1NzE3MzldJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzaXRlLXBvZC10ZXN0ZXItYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC53ZWJzaXRlLXBvZC10ZXN0ZXItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMjc2NDk2MDQ1XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuc3RhdGUtYnVja2V0LXRlc3Rlci1hc3N1bWU6IFJlYWRpbmcuLi4lMEFhd3NfaWFtX3VzZXJfcG9saWN5X2F0dGFjaG1lbnQudHdpbmRiX3Rlc3RfcnVubmVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10d2luZGJfdGVzdF9ydW5uZXItMjAyMzA3MDExODAwMzEwODQ3MDAwMDAwMDFdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTkyMzU4OTUwOV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNjg3NzUyMjcxXSUwQWF3c19pYW1fcm9sZS5zZXJ2aWNlLW5ldHdvcmstdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZXJ2aWNlLW5ldHdvcmstdGVzdGVyXSUwQWF3c19pYW1fcm9sZS5naGEtYWRtaW4tdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyXSUwQWF3c19pYW1fcm9sZS53ZWJzaXRlLXBvZC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNpdGUtcG9kLXRlc3Rlcl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1naXRodWJdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNlcnZpY2UtbmV0d29yay10ZXN0ZXItMjAyMzA3MDMxOTQyMjUyODc2MDAwMDAwMDFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnNlcnZpY2UtbmV0d29yay10ZXN0ZXItcHl0ZXN0LXBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZXJ2aWNlLW5ldHdvcmstdGVzdGVyLTIwMjMxMDA5MjAzMTI0ODQyODAwMDAwMDAyXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC53ZWJzaXRlLXBvZC10ZXN0ZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXdlYnNpdGUtcG9kLXRlc3Rlci0yMDIzMDgxMzE2MjYyMjI2NzIwMDAwMDAwMl0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQud2Vic2l0ZS1wb2QtdGVzdGVyLXNlcm5pdmUtbmV0d29yay1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9d2Vic2l0ZS1wb2QtdGVzdGVyLTIwMjMwODEzMTYyNjIyMTcyOTAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naGEtYWRtaW4tdGVzdGVyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1naGEtYWRtaW4tdGVzdGVyLTIwMjMxMDA5MTkzNDM0Njk3MTAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naGEtYWRtaW4tdGVzdGVyLXB5dGVzdC1wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Z2hhLWFkbWluLXRlc3Rlci0yMDIzMTAwOTIwMzEyNDg2NjEwMDAwMDAwM10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1naXRodWItMjAyMzA5MDgwMDQxMzg0NTk4MDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM1NzA1MzkxMjhdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1hZG1pbl0lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1jaWNkLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWNpY2QtY29udHJvbC0yMDIzMDYzMDAzMDgwMzk2MTIwMDAwMDAwMV0lMEFkYXRhLmF3c19pYW1fcG9saWN5LnJlYWQtb25seS1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L1JlYWRPbmx5QWNjZXNzXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctcmVhZC1vbmx5LTIwMjMwODExMTgwNjM1MDg0MDAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWFkbWluLTIwMjMwNzAyMTUyNzQ4NjQ2NDAwMDAwMDAxXSUwQW1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wdWJsaWMtYWNjZXNzOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5vbW5pYnVzLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmluZnJhaG91c2Utb21uaWJ1cy1jYWNoZS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sub21uaWJ1cy1jYWNoZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXSUwQW1vZHVsZS5pbmZyYWhvdXNlLW9tbmlidXMtY2FjaGUuYXdzX3MzX2J1Y2tldF9vd25lcnNoaXBfY29udHJvbHMub21uaWJ1cy1jYWNoZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQub21uaWJ1cy1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDI3NDA2ODI0OF0lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucHVibGljLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTIzNTg3ODA2XSUwQWF3c19pYW1fcG9saWN5Lm9tbmlidXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L29tbmlidXMyMDIzMDcyOTA0MjQzMTk5OTIwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQub21uaWJ1czogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9b21uaWJ1cy0yMDIzMDcyOTA0MjQzMjMyMzQwMDAwMDAwMl0lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfYWNsLm9tbmlidXMtY2FjaGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZSxwdWJsaWMtcmVhZF0lMEFtb2R1bGUuaW5mcmFob3VzZS1vbW5pYnVzLWNhY2hlLmF3c19zM19idWNrZXRfcG9saWN5LnB1YmxpYy1hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utb21uaWJ1cy1jYWNoZV0lMEElMEFUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uJTBBcGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOiUwQSAgKyBjcmVhdGUlMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgYXdzX2lhbV9wb2xpY3kuc3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwic3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICA9IFwic3RhdGUtYnVja2V0LXRlc3Rlci1wZXJtaXNzaW9uc1wiJTBBICAgICAgKyBuYW1lX3ByZWZpeCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzdHM6R2V0Q2FsbGVySWRlbnRpdHlcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzdHM6QXNzdW1lUm9sZVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCIqXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgYXdzX2lhbV9yb2xlLnN0YXRlLWJ1Y2tldC10ZXN0ZXIgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJzdGF0ZS1idWNrZXQtdGVzdGVyXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlXCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIEFXUyA9IFwiYXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTp1c2VyL2FsZWtzXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVXaXRoV2ViSWRlbnRpdHlcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIENvbmRpdGlvbiA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgU3RyaW5nRXF1YWxzID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJ0b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbTphdWRcIiA9IFwic3RzLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFN0cmluZ0xpa2UgICA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206c3ViXCIgPSBcInJlcG86aW5mcmFob3VzZS90ZXJyYWZvcm0tYXdzLXN0YXRlLWJ1Y2tldDoqXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgICAgIH0lMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIEZlZGVyYXRlZCA9IFwiYXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgKSUwQSAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgID0gXCJSb2xlIHRvIHRlc3QgbW9kdWxlIHRlcnJhZm9ybS1hd3MtZ2hhLWFkbWluXCIlMEEgICAgICArIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYW5hZ2VkX3BvbGljeV9hcm5zICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYXhfc2Vzc2lvbl9kdXJhdGlvbiAgPSAzNjAwJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgPSBcInN0YXRlLWJ1Y2tldC10ZXN0ZXJcIiUwQSAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcGF0aCAgICAgICAgICAgICAgICAgID0gXCIvXCIlMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdW5pcXVlX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIGF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwic3RhdGUtYnVja2V0LXRlc3RlclwiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gXCJhcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXCIlMEEgICAgICArIHJvbGUgICAgICAgPSBcInN0YXRlLWJ1Y2tldC10ZXN0ZXJcIiUwQSAgICB9JTBBJTBBICAjIGF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1idWNrZXQtdGVzdGVyLXB5dGVzdC1wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLWJ1Y2tldC10ZXN0ZXItcHl0ZXN0LXBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSBcImFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cG9saWN5L3B5dGVzdC1wZXJtaXNzaW9uczIwMjMxMDA5MjAzMTI0NTU1NTAwMDAwMDAxXCIlMEEgICAgICArIHJvbGUgICAgICAgPSBcInN0YXRlLWJ1Y2tldC10ZXN0ZXJcIiUwQSAgICB9JTBBJTBBUGxhbjogNCB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuJTBBJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDQsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>